Thanks Larry, looks like the other deletions from your terraform diff there were from some changes in master that I'd forgotten to apply. I just rectified that, and the diff now reads:

```
 $ terraform plan
google_service_account.mondo_notifier_func: Refreshing state... [id=projects/clingen-dx/serviceAccounts/clingen-mondo-notify@clingen-dx.iam.gserviceaccount.com]
google_cloudbuild_trigger.mondo_notifier_repo: Refreshing state... [id=projects/clingen-dx/triggers/4eca18e8-583b-4433-aad9-46b38ea58792]
google_service_account_iam_member.cloudbuild_mondo_notifier_binding: Refreshing state... [id=projects/clingen-dx/serviceAccounts/clingen-mondo-notify@clingen-dx.iam.gserviceaccount.com/roles/iam.serviceAccountUser/serviceAccount:974091131481@cloudbuild.gserviceaccount.com]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_secret_manager_secret_iam_member.kafka_creds_accessor will be created
  + resource "google_secret_manager_secret_iam_member" "kafka_creds_accessor" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "clingen-mondo-notify@clingen-dx.iam.gserviceaccount.com"
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "kafka_credentials"
    }

  # google_secret_manager_secret_iam_member.mondo_git_webhook_secret_accessor will be created
  + resource "google_secret_manager_secret_iam_member" "mondo_git_webhook_secret_accessor" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "clingen-mondo-notify@clingen-dx.iam.gserviceaccount.com"
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "mondo-git-webhook_secret"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

Which more closely aligns with the code change. Feel free to merge to master and apply, or let me know if you'd like me to apply the changes.